[
  {
    "title": "Securing a Laravel API in 20 minutes with JWTs",
    "id": "6eX9Pj-GhZs",
    "published": "Dec 9 2018",
    "description": "In this video you'll learn how you can secure a Laravel API and authenticate users within it using JSON Web Tokens."
  },
  {
    "title": "How to develop a simple Laravel package locally",
    "id": "Hr8Zc2Zkcjg",
    "published": "Oct 14 2019",
    "description": "In this 15 minute video, I'll show you how I developed a simple Laravel wrapper package that makes calls to an external API. "
  },
  {
    "title": "Create a local Laravel dev environment with Docker",
    "id": "5N6gTVCG_rw",
    "published": "Oct 29 2019",
    "description": "You'll learn how to create a docker-compose file and define services needed for Laravel and build a service from a local Dockerfile."
  },
  {
    "title": "How to use Laravel's bind and singleton methods",
    "id": "yg1qOom6YuE",
    "published": "Nov 25 2019",
    "description": "In this short video, I'll show you how to use Laravel's bind + singleton service provider methods in your application, as well as demo example use cases for both."
  },
  {
    "title": "Viewing a Docker MySQL database with PHPMyAdmin and Sequel Pro",
    "id": "ozKxWsojYJ4",
    "published": "Dec 17 2019",
    "description": "In this short video, I'll show you how to view a MySQL database created with Docker in both PHPMyAdmin and Sequel Pro. "
  },
  {
    "title": "Adding social logins with Laravel Socialite",
    "id": "FLsSEV5ulD4",
    "published": "Jan 14 2020",
    "description": "In this 10 minute video, I'll show you how to get started with Laravel Socialite by adding a fully-functional \"Sign In with GitHub\" button to an existing application."
  },
  {
    "title": "A much better local Laravel dev environment with Docker",
    "id": "I980aPL-NRM",
    "published": "Feb 13 2020",
    "description": "This is a follow-up to my original local Laravel dev environment with Docker video (watch that first). For those who want a more complete containerized solution, without having to have Composer, Node, or PHP installed locally!"
  },
  {
    "title": "Getting started with Amazon S3 storage in Laravel",
    "id": "BQ0gi9YHuek",
    "published": "Mar 5 2020",
    "description": "In this 15 minute video, I'll show you how to set up an Amazon S3 bucket to store images and files with your Laravel app using a few built-in methods."
  },
  {
    "title": "Adding geolocation and Google Maps to Vue applications",
    "id": "KARBEHUyooM",
    "published": "Apr 5 2020",
    "description": "In this video, I'll show you how to use two simple packages to introduce geolocation and embedded Google Maps to your new or existing Vue apps."
  },
  {
    "title": "Running multiple Laravel apps locally with Docker",
    "id": "LFrBmvgamGI",
    "published": "Apr 15 2020",
    "description": "In this 13 minute video, I'll show you how to run two separate Laravel applications using local Docker networks and communicate between them."
  },
  {
    "title": "Authentication in Vue using Laravel Sanctum",
    "id": "eeMtmkDZ72Q",
    "published": "May 6 2020",
    "description": "In this 23 minute video I'll show you how to set up a Laravel app and Vue component, and make authenticated calls using Laravel's Sanctum package."
  },
  {
    "title": "Easily deploy a Laravel application with Docker",
    "id": "G5Nk4VykcUw",
    "published": "May 20 2020",
    "description": "In this 21 minute video, I'll show you how to easily deploy a Laravel application using Docker and two separate methods to get source files on a server."
  },
  {
    "title": "5 tips for supercharged Laravel Eloquent queries",
    "id": "TuPdEbEBvo0",
    "published": "Jul 2 2020",
    "description": "In this 16 minute video, I'll show you 5 simple tips and tricks that you can use to enhance your Laravel Eloquent queries, saving time and helping to clean up your code."
  },
  {
    "title": "Populating a Google Map with Vue and Laravel",
    "id": "FkibP9Wnreo",
    "published": "Jul 14 2020",
    "description": "In this 25 minute video, I'll show you how to create and embed a Google Map with Vue, then populate that same map with pins and pop-up info windows using data pulled in from a Laravel API."
  },
  {
    "title": "Let's build with Laravel: A Linktree clone",
    "id": "30qk04BG9G4",
    "published": "Aug 25 2020",
    "description": "In my longest video yet at just under 1 hour, I'll show you how to create a basic Linktree (https://linktr.ee) clone from scratch in Laravel."
  },
  {
    "title": "Running scheduled Laravel tasks with Docker",
    "id": "2UTHJpBRGpY",
    "published": "Sep 7 2020",
    "description": "In this 17 minute video, I'll show you how to schedule and run Laravel Artisan commands inside of a Docker environment. These techniques can be used for local development or production environments."
  },
  {
    "title": "Organizing data with Laravel collections",
    "id": "a2QvlLs0uEk",
    "published": "Oct 12 2020",
    "description": "In this 32 minute video, I'll show you 12 examples using Laravel Collections that you can use to organize, sort, and filter your large or complex data sets."
  },
  {
    "title": "Build a Vue shopping cart with Laravel Cashier and Stripe",
    "id": "gvnxd1xne7Q",
    "published": "Dec 30 2020",
    "description": "In this 55 minute video, I'll show you how to create a basic e-commerce site powered by a Vue SPA and Laravel API, which takes payments through Stripe thanks to the Laravel Cashier package."
  },
  {
    "title": "Getting started with Laravel Breeze and Jetstream",
    "id": "p_ZYVObwBXQ",
    "published": "Jan 19 2021",
    "description": "In this 28 minute video, I'll show you how to install and use the Breeze and Jetstream authentication starter kits in a new Laravel application."
  },
  {
    "title": "Build a solid WordPress dev environment with Docker",
    "id": "kIqWxjDj4IU",
    "published": "Mar 21 2021",
    "description": "In this 25 minute video, I'll show you how to create and use a basic WordPress development environment built with Docker and Docker Compose."
  },
  {
    "title": "Getting started with Laravel Passport and OAuth2",
    "id": "PTFPMAX_88s",
    "published": "May 11 2021",
    "description": "In this 29 minute video, I'll show you how to install and use the powerful Passport authentication package in an example Laravel application."
  }
]
